blog/8.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP. 1.2.6
#+subtitle: 2023-01-23 Mon
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)
#+latex_header:

Here is one way to find whether a number is prime:
#+begin_src emacs-lisp
  (defun smallest-divisor (n)
    (find-divisor n 2))

  (defun find-divisor (n test-divisor)
    (cond ((> (square test-divisor) n)
           n)
          ((dividesp test-divisor n)
           test-divisor)
          (t (find-divisor
              n
              (+ test-divisor 1)))))

  (defun dividesp (a b)
    (= (% b a ) 0))

  (defun primep (n)
    (= n (smallest-divisor n)))
#+end_src

In the worst case scenario we have to call test-divisor $\sqrt{n}$
times. So, the order of growth is $\Theta (\sqrt{n})$.

The authors also present a $\Theta (log(n))$ algorithm to tests
primality. This algorithm is based on the so-called Fermat's Little
Theorem:

- *Fermat's Little Theorem*: If $n$ is a prime number and $a$ is any
  positive integer less than n, then $a$ raised ot the $n^{th}$ power
  is congruent to $a$ modulo $n$.

#+begin_src emacs-lisp
  (defun expmod (base exp m)
    (cond ((= exp 0) 1)
          ((evenp exp)
           (%
            (square (expmod base (/ exp 2) m))
            m))
          (t
           (%
            (* base (expmod base (- exp 1) m))
            m))))

  (defun try-it (a n)
    (= (expmod a n n) a))

  (defun fermat-test (n)
    (try-it (+ 1 (random (- n 1))) n))

  (defun fast-primep (n times)
    (cond ((= times 0) t)
          ((fermat-test n)
           (fast-primep n (- times 1)))
          (t nil)))

  (defun evenp (n)
    (= (% n 2) 0)
#+end_src  

* Exercise 1.21
Exercise:
#+begin_quote
Use the smallest-divisor procedure to find the smallest divisor of
each of the following numbers: 199, 1999, 19999.
#+end_quote

Answer:
#+begin_src emacs-lisp
  (smallest-divisor 199)   ;; => 199
#+end_src

This is the series of procedure calls:
#+begin_src emacs-lisp
  (smallest-divisor 199)
  (find-divisor 199 2)
  (cond ((> (square 2) 199)
         199)
        ((dividesp 2 199)
         2)
        (t (find-divisor
            199
            (+ 2 1))))
  (find-divisor 199 3)
  (find-divisor 199 4)
  (find-divisor 199 5)
  (find-divisor 199 6)
  (find-divisor 199 7)
  (find-divisor 199 8)
  (find-divisor 199 9)
  (find-divisor 199 10)
  (find-divisor 199 11)
  (find-divisor 199 12)
  (find-divisor 199 13)
  (find-divisor 199 14)
  (find-divisor 199 15)
  199
#+end_src


#+begin_src emacs-lisp
  (smallest-divisor 1999)  ;; => 1999
#+end_src

This is the series of procedure calls:
#+begin_src emacs-lisp
  (smallest-divisor 1999)
  (find-divisor 1999 2)

  (cond ((> (square 2) 1999)
         1999)
        ((dividesp 2 1999)
         2)
        (t (find-divisor
               1999
               (+ 2 1))))

  (find-divisor 1999 3)

  (find-divisor 1999 4)

  ;; ...

  (find-divisor 1999 45)

  1999
#+end_src



#+begin_src emacs-lisp
  (smallest-divisor 19999) ;; => 7
#+end_src
This is the series of procedure calls:
#+begin_src emacs-lisp
  (smallest-divisor 19999)

  (find-divisor 19999 2)

  (find-divisor 19999 3)

  (find-divisor 19999 4)

  (find-divisor 19999 5)

  (find-divisor 19999 6)

  (find-divisor 19999 7)
  7
#+end_src

