blog/8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-23 Mon 23:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 1.2.6</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 1.2.6
<br />
<span class="subtitle">2023-01-23 Mon</span>
</h1>
<p>
Here is one way to find whether a number is prime:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">smallest-divisor</span> (n)
  (find-divisor n 2))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">find-divisor</span> (n test-divisor)
  (<span style="color: #b9ca4a;">cond</span> ((&gt; (square test-divisor) n)
         n)
        ((dividesp test-divisor n)
         test-divisor)
        (t (find-divisor
            n
            (+ test-divisor 1)))))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">dividesp</span> (a b)
  (= (% b a ) 0))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">primep</span> (n)
  (= n (smallest-divisor n)))
</pre>
</div>

<p>
In the worst case scenario we have to call test-divisor \(\sqrt{n}\)
times. So, the order of growth is \(\Theta (\sqrt{n})\).
</p>

<p>
The authors also present a \(\Theta (log(n))\) algorithm to tests
primality. This algorithm is based on the so-called Fermat's Little
Theorem:
</p>

<ul class="org-ul">
<li><b>Fermat's Little Theorem</b>: If \(n\) is a prime number and \(a\) is any
positive integer less than n, then \(a\) raised ot the \(n^{th}\) power
is congruent to \(a\) modulo \(n\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">expmod</span> (base exp m)
  (<span style="color: #b9ca4a;">cond</span> ((= exp 0) 1)
        ((evenp exp)
         (%
          (square (expmod base (/ exp 2) m))
          m))
        (t
         (%
          (* base (expmod base (- exp 1) m))
          m))))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">try-it</span> (a n)
  (= (expmod a n n) a))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fermat-test</span> (n)
  (try-it (+ 1 (random (- n 1))) n))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-primep</span> (n times)
  (<span style="color: #b9ca4a;">cond</span> ((= times 0) t)
        ((fermat-test n)
         (fast-primep n (- times 1)))
        (t nil)))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">evenp</span> (n)
  (= (% n 2) 0)
</pre>
</div>

<div id="outline-container-org1353db5" class="outline-2">
<h2 id="org1353db5">Exercise 1.21</h2>
<div class="outline-text-2" id="text-org1353db5">
<p>
Exercise:
</p>
<blockquote>
<p>
Use the smallest-divisor procedure to find the smallest divisor of
each of the following numbers: 199, 1999, 19999.
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 199)   <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; 199</span>
</pre>
</div>

<p>
This is the series of procedure calls:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 199)
(find-divisor 199 2)
(<span style="color: #b9ca4a;">cond</span> ((&gt; (square 2) 199)
       199)
      ((dividesp 2 199)
       2)
      (t (find-divisor
          199
          (+ 2 1))))
(find-divisor 199 3)
(find-divisor 199 4)
(find-divisor 199 5)
(find-divisor 199 6)
(find-divisor 199 7)
(find-divisor 199 8)
(find-divisor 199 9)
(find-divisor 199 10)
(find-divisor 199 11)
(find-divisor 199 12)
(find-divisor 199 13)
(find-divisor 199 14)
(find-divisor 199 15)
199
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 1999)  <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; 1999</span>
</pre>
</div>

<p>
This is the series of procedure calls:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 1999)
(find-divisor 1999 2)

(<span style="color: #b9ca4a;">cond</span> ((&gt; (square 2) 1999)
       1999)
      ((dividesp 2 1999)
       2)
      (t (find-divisor
             1999
             (+ 2 1))))

(find-divisor 1999 3)

(find-divisor 1999 4)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>

(find-divisor 1999 45)

1999
</pre>
</div>



<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 19999) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">=&gt; 7</span>
</pre>
</div>
<p>
This is the series of procedure calls:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(smallest-divisor 19999)

(find-divisor 19999 2)

(find-divisor 19999 3)

(find-divisor 19999 4)

(find-divisor 19999 5)

(find-divisor 19999 6)

(find-divisor 19999 7)
7
</pre>
</div>

<div style="text-align: center;">
<a href="https://pietroiusti.github.io/blog/posts.html">←</a>
</div>
</div>
</div>
