blog/8.html

<div id="outline-container-org02427a4" class="outline-2">
<h2 id="org02427a4">Exercise 1.22</h2>
<div class="outline-text-2" id="text-org02427a4">
<blockquote>
<p>
Most Lisp implementations include a primitive called runtime that
returns an integer that specifies the amount of time the system has
been running (measured, for example, in microseconds). The following
timed-prime-test procedure, when called with an integer n, prints n
and checks to see if n is prime. If n is prime, the procedure prints
three asterisks followed by the amount of time used in performing the
test.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">timed-prime-test</span> n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">start-prime-test</span> n start-time)
  (<span style="color: #b9ca4a;">if</span> (prime? n)
      (report-prime (- (runtime)
                       start-time))))
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">report-prime</span> elapsed-time)
  (display <span style="color: #70c0b1;">" *** "</span>)
  (display elapsed-time))
</pre>
</div>

<p>
Using this procedure, write a procedure search-for-primes that checks
the primality of consecutive odd integers in a specified range. Use
your procedure to find the three smallest primes larger than 1000;
larger than 10,000; larger than 100,000; larger than 1,000,000. Note
the time needed to test each prime. Since the testing algorithm has
order of growth of \(\theta (\sqrt{n})\), you should expect that testing
for primes around 10,000 should take about \(\sqrt{10}\) times as long
as testing for primes around 1000. Do your timing data bear this out?
How well do the data for 100,000 and 1,000,000 support the \(\theta
(\sqrt{n})\) prediction? Is your result compatible with the notion that
programs on your machine run in time proportional to the number of
steps required for the computation?
</p>
</blockquote>

<p>
Answer:
</p>

<p>
For this exercise I'm using (Dr)Racket, which provides a version of
Scheme specifically modified in order to be used for SICP's code
(useful here in that it provides <code>runtime</code>.).
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">square</span> x)
  (* x x))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">smallest-divisor</span> n)
  (find-divisor n 2))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">find-divisor</span> n test-divisor)
  (<span style="color: #b9ca4a;">cond</span> ((&gt; (square test-divisor) n)
         n)
        ((divides? test-divisor n)
         test-divisor)
        (<span style="color: #b9ca4a;">else</span> (find-divisor
               n
               (+ test-divisor 1)))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">divides?</span> a b)
  (= (remainder b a) 0))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">prime?</span> n)
  (= n (smallest-divisor n)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">timed-prime-test</span> n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">start-prime-test</span> n start-time)
  (<span style="color: #b9ca4a;">if</span> (prime? n)
      (report-prime (- (runtime)
                       start-time))))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">report-prime</span> elapsed-time)
  (display <span style="color: #70c0b1;">" *** "</span>)
  (display elapsed-time))

(timed-prime-test 199) <span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">199 *** 6</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">search-for-primes</span> begin end)
  (<span style="color: #b9ca4a;">cond</span> ((&lt; begin end)
         (timed-prime-test begin)
         (search-for-primes (+ 2 begin) end))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(search-for-primes 1001 1021)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1001</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1003</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1005</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1007</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1009 *** 5</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1011</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1013 *** 4</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1015</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1017</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1019 *** 3</span>

(search-for-primes 10001 10050)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10001</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10003</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10005</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10007 *** 12</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10009 *** 9</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10011</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10013</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10015</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10017</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10019</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10021</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10023</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10025</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10027</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10029</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10031</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10033</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10035</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10037 *** 8</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10039 *** 8</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10041</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10043</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10045</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10047</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">10049</span>

(search-for-primes 100001 100050)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100001</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100003 *** 22</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100005</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100007</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100009</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100011</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100013</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100015</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100017</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100019 *** 21</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100021</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100023</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100025</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100027</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100029</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100031</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100033</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100035</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100037</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100039</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100041</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100043 *** 21</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100045</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100047</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">100049 *** 20</span>

(search-for-primes 1000001 1000051)

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000001</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000003 *** 79</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000005</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000007</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000009</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000011</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000013</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000015</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000017</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000019</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000021</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000023</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000025</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000027</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000029</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000031</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000033 *** 63</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000035</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000037 *** 62</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000039 *** 65</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000041</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000043</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000045</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000047</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">1000049</span>
</pre>
</div>

<p>
I have been told that this exercise (and following ones) might be a
bit out of date, given the advancements in computer hardware
technology. Given the small size of the amounts of time in question,
measurement's accuracy is probably not to be trusted.
</p>

<p>
Let's do some measure nonetheless; using bigger numbers.
</p>

<p>
Computing <code>(timed-prime-test 34888314291653)</code> &#x2014; I've chosen randomly
&#x2014; took 642.775 milliseconds. These should be enough to have an
acceptable accuracy in our benchmarking. Let's start our experiments
from here.
</p>

<p>
Let's find the first three primes starting from 34888314291653.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291653 *** 701102</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291655</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291657</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291659</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291661</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291663</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291665</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291667 *** 895322</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291669</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291671</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291673</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291675</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291677</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291679</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291681</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291683</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291685</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291687</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291689</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291691</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291693</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291695</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291697</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291699</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291701</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291703</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291705</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291707</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291709</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291711</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291713 *** 630255</span>
</pre>
</div>

<p>
Now we multiply 34888314291653 by ten and find the first three primes
starting from there. 34888314291653 times 10 is 348883142916530.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916531</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916533 *** 2027795</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916535</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916537</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916539</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916541</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916543</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916545</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916547</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916549</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916551</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916553</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916555</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916557</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916559</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916561</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916563</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916565</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916567</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916569</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916571</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916573</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916575</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916577</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916579</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916581</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916583</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916585</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916587</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916589</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916591</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916593</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916595</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916597</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916599</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916601</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916603</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916605</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916607</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916609</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916611</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916613 *** 1893341</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916615</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916617</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916619</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916621</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916623</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916625</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916627</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916629</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916631</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916633</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916635</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916637</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916639</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916641</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916643</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916645</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916647</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916649</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916651</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916653</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916655</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916657</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916659</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916661</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916663</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916665</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916667</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916669</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916671</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916673</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916675</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916677</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916679</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916681</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916683</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916685</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916687</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916689</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916691</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916693</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916695</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916697</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916699</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916701</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916703</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916705</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916707</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916709</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916711</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916713</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916715</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916717</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916719</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916721</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916723</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916725</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916727</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916729</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916731</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916733</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916735</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916737</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">348883142916739 *** 1809663</span>
</pre>
</div>

<p>
(* 701102 (sqrt 10)) = 2217079.192099371. With 348883142916533 we
took 2027795, so the prediction is roughly correct.
</p>

<p>
Let us now test whether the number we find after (*
10 348883142916530) and those after (* 10 10 348883142916530) fulfill
the prediction too.
</p>

<blockquote>
<p>
3488831429165323 <b>*</b> 5971326
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-scheme">(search-for-primes 3488831429165301 3488831429165401)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">3488831429165323 *** 5971326</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(search-for-primes 34888314291653011 34888314291653511)
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">34888314291653021 *** 16052655</span>
<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>
</pre>
</div>

<p>
(* 5971326 (sqrt 10)) 18882990.81138261. Again, the prediction seems
roughly correct.
</p>
</div>
</div>
