blog/8.html

<div id="outline-container-org44f4251" class="outline-2">
<h2 id="org44f4251">Exercise 1.23</h2>
<div class="outline-text-2" id="text-org44f4251">
<blockquote>
<p>
The <code>smallest-divisor</code> procedure shown at the start of this section
does lots of needless testing: After it checks to see if the number is
divisible by 2 there is no point in checking to see if it is divisible
by any larger even numbers. This suggests that the values used for
<code>test-divisor</code> should not be 2, 3, 4, 5, 6, …, but rather 2, 3, 5, 7,
9, …. To implement this change, define a procedure next that returns 3
if its input is equal to 2 and otherwise returns its input
plus 2. Modify the <code>smallest-divisor</code> procedure to use <code>(next
test-divisor)</code> instead of <code>(+ test-divisor 1)</code>. With
<code>timed-prime-test</code> incorporating this modified version of
<code>smallest-divisor</code>, run the test for each of the 12 primes found in
Exercise 1.22. Since this modification halves the number of test
steps, you should expect it to run about twice as fast. Is this
expectation confirmed? If not, what is the observed ratio of the
speeds of the two algorithms, and how do you explain the fact that it
is different from 2?
</p>
</blockquote>

<p>
Answer:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">smallest-divisor-mod</span> n)
  (find-divisor-mod n 2))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">find-divisor-mod</span> n test-divisor)
  (<span style="color: #b9ca4a;">cond</span> ((&gt; (square test-divisor) n)
         n)
        ((divides? test-divisor n)
         test-divisor)
        (<span style="color: #b9ca4a;">else</span> (find-divisor
               n
               (next test-divisor)))))

<span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">...</span>

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">next</span> n)
  (<span style="color: #b9ca4a;">if</span> (= n 2)
      3
      (+ n 1)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">prime?-mod</span> n)
  (= n (smallest-divisor-mod n)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">timed-prime-test-mod</span> n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">start-prime-test-mod</span> n start-time)
  (<span style="color: #b9ca4a;">if</span> (prime?-mod n)
      (report-prime (- (runtime)
                       start-time))))
</pre>
</div>

<p>
I haven't observed any relevant difference with the numbers I have
tested. I'm not sure why that is so. One possible explanation is that
the numbers I have tested are too small. Another possible explanation
is that Racket performs some optimizations.
</p>

<div style="text-align: center;">
<a href="https://pietroiusti.github.io/blog/posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
